       identification division.
       program-id. sec.
       environment division.
       data division.
       procedure division.
           display "Second program".
      *    stop run.
       end program sec.
