      *    GBXtreme: The worlds best COBOL GameBoy Emulator
      *    Written by Grace
      
       identification division.
       program-id. GBX.
       author. Grace <3
       environment division.
       data division.
       working-storage section.
           
       procedure division.
       

       end program GBX.
